package study2;
 // 소스파일의 이름  = public class의 이름이 같아야함. 
//public을 제외한 나머지는 class이름으로 지정해서 작성할 것.
//클래스를 선언하기 위해 클래스이름.java로 소스파일을 생성해야함.
//소스파일의 이름의 대소문자는 항상 구분해서 작성하기
//ㅇ클래스이름 첫글자는 대문자, 연속단어의 첫글자는 모두 대문자
//public class 키워드는 모두 소문자!
//클래스로부터 객체를 만드는 과정 - 인스턴스화
//클래스로부터 만들어진 객체 - 클래스의 인스턴스
//인스턴스와 객체는 같은 의미이지만, 객체는 포괄적 인스턴스는 구체적
//class는 한 소스파일당 하나씩 만드는게 일반적
//클래스의 용도 중 하나는 라이브러리용 (이용할 목적)
//클래스의 다른 용도는 실행용 main()메소드를 가지고 있음.(실행 진입점 가짐)
//객체는 속성(필드)과 기능(메소드)이 하벼진 것 
//클래스란 객체를 정의해놓은 것 = 설계도
//클래스 구성요소는 필드, 생성자, 메소드
//변수는 메소드, 생성자 내부에서 사용될 수 있으며 로컬변수임
//필드는 생성자, 메소드 전체에서 사용될 수 있음
//필드는 상태 정보를 저장하는 곳임 / 객체가 소멸되지 않는 한 함꼐 존재
//생성자의 역할은 객체 생성 시 초기화를 담당
//필드를 초기화하거나 메소드를 호출해서 객체를 사용할 준비함.
//생성자는 메소드와 비슷하게 생겼지만 클래스 이름으로 되어있고 리턴타입 업습
//메소드는 객체 간의 데이터 전달 수단이며, 객체의 동작 담당 
//메소드 호출하면 중괄호 내의 코드가 일괄적 실행됨
//외부로부터 매개값을 받을 수 도 있고, 실행 후 ㅇ떤 값을 리턴할 수 있음.
public class SportCar {

	public static void main(String[] args) {
		

	}

}
